export const LEVELS = {
  "chapters": [
    {
      "id": "ch1",
      "title": "初见灵光",
      "levels": [
        {
          "cards": [
            2,
            6,
            9,
            5
          ],
          "solution": "(9+(5/(2/6)))"
        },
        {
          "cards": [
            1,
            5,
            2,
            6
          ],
          "solution": "((1+5)*(6-2))"
        },
        {
          "cards": [
            7,
            1,
            9,
            8
          ],
          "solution": "(8*(9-(7-1)))"
        },
        {
          "cards": [
            9,
            1,
            7,
            4
          ],
          "solution": "((9-1)*(7-4))"
        },
        {
          "cards": [
            6,
            2,
            9,
            9
          ],
          "solution": "(2*(9-(6-9)))"
        },
        {
          "cards": [
            6,
            8,
            3,
            9
          ],
          "solution": "((8*9)/(6-3))"
        },
        {
          "cards": [
            4,
            8,
            5,
            3
          ],
          "solution": "((4+8)*(5-3))"
        },
        {
          "cards": [
            2,
            8,
            8,
            4
          ],
          "solution": "((2-8)*(4-8))"
        }
      ]
    },
    {
      "id": "ch2",
      "title": "凑数心法",
      "levels": [
        {
          "cards": [
            7,
            5,
            6,
            1
          ],
          "solution": "((5*6)-(7-1))"
        },
        {
          "cards": [
            2,
            8,
            9,
            7
          ],
          "solution": "((2*(9+7))-8)"
        },
        {
          "cards": [
            3,
            2,
            6,
            9
          ],
          "solution": "(6*(9-(3+2)))"
        },
        {
          "cards": [
            3,
            9,
            4,
            3
          ],
          "solution": "((3+9)+(4*3))"
        },
        {
          "cards": [
            6,
            5,
            1,
            9
          ],
          "solution": "((6*1)*(9-5))"
        },
        {
          "cards": [
            1,
            4,
            7,
            4
          ],
          "solution": "((7*4)-(1*4))"
        },
        {
          "cards": [
            4,
            7,
            2,
            4
          ],
          "solution": "((4*2)*(7-4))"
        },
        {
          "cards": [
            2,
            6,
            5,
            7
          ],
          "solution": "((2*6)+(5+7))"
        }
      ]
    },
    {
      "id": "ch3",
      "title": "精准加减",
      "levels": [
        {
          "cards": [
            3,
            7,
            1,
            3
          ],
          "solution": "((3*7)+(1*3))"
        },
        {
          "cards": [
            2,
            6,
            6,
            3
          ],
          "solution": "((2+6)*(6-3))"
        },
        {
          "cards": [
            9,
            9,
            7,
            6
          ],
          "solution": "((7*6)-(9+9))"
        },
        {
          "cards": [
            6,
            6,
            7,
            3
          ],
          "solution": "(3*(7+(6/6)))"
        },
        {
          "cards": [
            3,
            7,
            3,
            2
          ],
          "solution": "(3*((3+7)-2))"
        },
        {
          "cards": [
            3,
            7,
            4,
            2
          ],
          "solution": "(4+(2*(3+7)))"
        },
        {
          "cards": [
            9,
            5,
            6,
            8
          ],
          "solution": "(6*(8-(9-5)))"
        },
        {
          "cards": [
            8,
            9,
            5,
            3
          ],
          "solution": "((9*3)-(8-5))"
        }
      ]
    },
    {
      "id": "ch4",
      "title": "乘法速算",
      "levels": [
        {
          "cards": [
            2,
            9,
            6,
            4
          ],
          "solution": "(6+(4/(2/9)))"
        },
        {
          "cards": [
            9,
            7,
            6,
            3
          ],
          "solution": "(3*(6+(9-7)))"
        },
        {
          "cards": [
            6,
            5,
            9,
            4
          ],
          "solution": "((6+5)+(9+4))"
        },
        {
          "cards": [
            9,
            2,
            5,
            5
          ],
          "solution": "((9+5)+(2*5))"
        },
        {
          "cards": [
            2,
            6,
            8,
            9
          ],
          "solution": "(8*((2*6)-9))"
        },
        {
          "cards": [
            8,
            1,
            8,
            3
          ],
          "solution": "((8+1)*(8/3))"
        },
        {
          "cards": [
            3,
            7,
            1,
            5
          ],
          "solution": "((3-1)*(7+5))"
        },
        {
          "cards": [
            8,
            2,
            9,
            4
          ],
          "solution": "(8*(9-(2+4)))"
        }
      ]
    },
    {
      "id": "ch5",
      "title": "大师残局",
      "levels": [
        {
          "cards": [
            4,
            2,
            5,
            6
          ],
          "solution": "((5*6)-(4+2))"
        },
        {
          "cards": [
            2,
            6,
            9,
            6
          ],
          "solution": "((2+6)*(9-6))"
        },
        {
          "cards": [
            2,
            7,
            3,
            2
          ],
          "solution": "(2*(3+(2+7)))"
        },
        {
          "cards": [
            8,
            6,
            1,
            4
          ],
          "solution": "(6*((8*1)-4))"
        },
        {
          "cards": [
            7,
            1,
            2,
            2
          ],
          "solution": "((7-1)*(2+2))"
        },
        {
          "cards": [
            6,
            6,
            5,
            1
          ],
          "solution": "((6*5)-(6*1))"
        },
        {
          "cards": [
            7,
            4,
            2,
            7
          ],
          "solution": "((2*(7+7))-4)"
        },
        {
          "cards": [
            3,
            3,
            6,
            1
          ],
          "solution": "(3*((3+6)-1))"
        }
      ]
    }
  ]
};